configuration/src/InformationRegisters/ИсторияСоставаСпринтов/ИсторияСоставаСпринтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСоставаСпринтов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияСоставаСпринтов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Создает запись в регистре сведений 
Процедура Добавить(Знач Ссылка, Знач Спринт, Знач Статус) Экспорт
	
	НоваяЗапись = РегистрыСведений.ИсторияСоставаСпринтов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Объект = Ссылка;
	НоваяЗапись.Спринт = Спринт;
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
